book/assets/assessments/psychopyAssessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 05:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Psychopy Assessement</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Psychopy Assessement</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcf7bb03">1. Task</a></li>
<li><a href="#org600e851">2. Objective</a></li>
<li><a href="#org4e54274">3. Detailed Instructions</a></li>
<li><a href="#org03bfe7e">4. Hints</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf7bb03" class="outline-2">
<h2 id="orgcf7bb03"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<p>
Submit a .py file that demonstrates a minimal version of a single trial of a Posner cuing task.
</p>
</div>
</div>

<div id="outline-container-org600e851" class="outline-2">
<h2 id="org600e851"><span class="section-number-2">2.</span> Objective</h2>
<div class="outline-text-2" id="text-2">
<p>
To familiarize yourself with the basic elements of the psychopy library and how to combine a few of them into something that could become a psychology experiment. We will use the <a href="https://en.wikipedia.org/wiki/Posner_cueing_task">Posner Cuing</a> task for this project.
</p>
</div>
</div>

<div id="outline-container-org4e54274" class="outline-2">
<h2 id="org4e54274"><span class="section-number-2">3.</span> Detailed Instructions</h2>
<div class="outline-text-2" id="text-3">
<p>
Provide me with a python file that,
</p>
<ol class="org-ol">
<li>Imports the psychopy library elements (and any other necessary libraries) in order to,</li>
<li>Places a white cross (or plus sign) at the center of the screen. Make the cross white and the background gray. Imagine the cross is to be our "fixation spot."</li>
<li>After a delay a white square appears to the right or left of fixation (the side to be chose randomly on each trial).</li>
<li>200 ms after the white square appears a black dot (or filled circle) appears either in the center of the white square or equidistant on the other side. The first if a "valid" cue condition, and the second is "invalid."</li>
<li>Require the user/participant to press the z button on the keyboard if the target (black dot) is on the left and the "/" key if the target is on the right.</li>
<li>After the keypress print to the screen which key was pressed and how much time elapsed between the appearance of the black dot and the key press. This is your reaction time (RT).</li>
<li><span class="underline">Optional</span> if that comes very quickly make a loop to do this ten times and write the results to a file rather than putting them on the screen.</li>
</ol>
</div>
</div>

<div id="outline-container-org03bfe7e" class="outline-2">
<h2 id="org03bfe7e"><span class="section-number-2">4.</span> Hints</h2>
<div class="outline-text-2" id="text-4">
<p>
The following psychopy objects may be useful.
</p>
<ol class="org-ol">
<li>Visual.window</li>
<li>Visual.TextStim</li>
<li>Visual.ShapeStim or Visual.Circle</li>
<li>Core.Quit</li>
<li>Clock.Clock</li>
<li>Clock.getTime</li>
<li>Clock.wait</li>
<li>Event.getKeys</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-14 Tue 05:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>